GGber/STM32PD_sniffer/code/CherryUSB/port/fsdev/usb_glue_st.c
/*
 * Copyright (c) 2025, sakumisu
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include "usbd_core.h"
#include "stm32g4xx_hal.h"

#if !defined(HAL_PCD_MODULE_ENABLED)
#error please define HAL_PCD_MODULE_ENABLED in stm32xxx_hal_conf.h
#endif

#ifndef CONFIG_USBDEV_FSDEV_PMA_ACCESS
#error "please define CONFIG_USBDEV_FSDEV_PMA_ACCESS in usb_config.h"
#endif

#if CONFIG_USBDEV_FSDEV_PMA_ACCESS != PMA_ACCESS
#error "CONFIG_USBDEV_FSDEV_PMA_ACCESS must be equal PMA_ACCESS"
#endif

struct fsdev_instance {
    USB_TypeDef *Instance;
};

static struct fsdev_instance g_fsdev_instance;

void usb_dc_low_level_init(uint8_t busid)
{
    g_fsdev_instance.Instance = (USB_TypeDef *)g_usbdev_bus[busid].reg_base;
    HAL_PCD_MspInit((PCD_HandleTypeDef *)&g_fsdev_instance);
}

void usb_dc_low_level_deinit(uint8_t busid)
{
    g_fsdev_instance.Instance = (USB_TypeDef *)g_usbdev_bus[busid].reg_base;
    HAL_PCD_MspDeInit((PCD_HandleTypeDef *)&g_fsdev_instance);
}

void USB_IRQHandler(void)
{
    USBD_IRQHandler(0);
}

void USB_LP_IRQHandler(void)
{
    USBD_IRQHandler(0);
}
